/**
计算k以内能被13或17整除的自然数之和
功能：计算出k以内最大的10个能被13或17整除的自然数之和。如果不足10个，则仅计算符合条件的数字之和。
输入格式:
输入一个整数k,1<k<=6000。
输出格式:
输出符合条件的自然数之和的值
输入样例1:
2000
输出样例1:
19525
输入样例2:
5
输出样例2:
0

*/

#include <stdio.h>

int main()
{
    int k=0,m=0,mc=0;
    printf("清输入您想输入的自然数k（1<k<=6000)\n");
    scanf("%d",&k);
    while ((k >= 2 && k<=6000 ) && (mc < 10))
    {
        if ((k % 13 == 0) || (k % 17 == 0))
        {
            m = m + k;  
            mc++;
        }
        k--;
    }
    printf("自然数之和的值为%d\n",m);
}













